# Day 24 â€” Pandas Foundations Practice

In [15]:

import pandas as pd
df = pd.read_csv("day_24_data.csv")
df.head()

   student_id   name       city  math_score  science_score  attendance
0           1  Aanya      Delhi          85             80          92
1           2  Meera     Mumbai          90             85          88
2           3   Riya       Pune          78             75          85
3           4  Pooja      Delhi          88             90          95
4           5  Sneha  Bangalore          92             89          98

## Inspect Data

In [16]:
print("Tail function: \n")
df.tail()

print("Info function: \n")
df.info()

print("Describe function: \n")
df.describe()

Tail function:

Info function:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   student_id     10 non-null     int64
 1   name           10 non-null     object
 2   city           10 non-null     object
 3   math_score     10 non-null     int64
 4   science_score  10 non-null     int64
 5   attendance     10 non-null     int64
dtypes: int64(4), object(2)
memory usage: 612.0+ bytes
Describe function:

       student_id  math_score  science_score  attendance
count    10.00000   10.000000      10.000000   10.000000
mean      5.50000   83.900000      82.000000   89.500000
std       3.02765    8.279157       8.082904    6.023104
min       1.00000   69.000000      70.000000   80.000000
25%       3.25000   78.750000      76.000000   85.500000
50%       5.50000   86.000000      82.500000   89.000000
75%       7.75000   89.500000      88.250000   94.250000
max      10.00000   95.000000      94.000000   98.000000

## Selecting Columns

In [17]:

df["name"]
df[["name","city"]]

    name       city
0  Aanya      Delhi
1  Meera     Mumbai
2   Riya       Pune
3  Pooja      Delhi
4  Sneha  Bangalore
5    Ira     Mumbai
6  Naina       Pune
7  Kavya      Delhi
8   Diya  Bangalore
9   Tara       Pune

## Filtering Rows

In [18]:

df[df["math_score"] > 85]
df[df["city"] == "Delhi"]

   student_id   name   city  math_score  science_score  attendance
0           1  Aanya  Delhi          85             80          92
3           4  Pooja  Delhi          88             90          95
7           8  Kavya  Delhi          69             72          83

## Practice Exercises

In [19]:

# EXERCISE 1: Show students with attendance > 90
df[df["attendance"] > 90]

   student_id   name       city  math_score  science_score  attendance
0           1  Aanya      Delhi          85             80          92
3           4  Pooja      Delhi          88             90          95
4           5  Sneha  Bangalore          92             89          98
8           9   Diya  Bangalore          95             94          97

In [20]:
# EXERCISE 2: Show names and science_score of Pune students
df[df["city"] == "Pune"][["name", "science_score"]]

    name  science_score
2   Riya             75
6  Naina             79
9   Tara             86

In [21]:
# EXERCISE 3: Find average math_score
df["math_score"].mean()

np.float64(83.9)